01-intro-to-rails/flatiron-theatre-api/app/controllers/productions_controller.rb

SELECT "productions".* FROM "productions"
---
    def index
        render json: Production.all

SELECT "productions".* FROM "productions" WHERE "productions"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def show
        render json: Production.find(params[:id])